Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/E13C.tmx
Source language: en_us
Languages: zh_cn

source: Sherried squash soup
zh_cn: 雪利冬南瓜汤

source: A good soup soon becomes a fail safe recipe for any occasion.
zh_cn: 无论何时，备上一碗好汤总错不了。

source: You can always miss out the sherry if making for children
zh_cn: 即使为了孩子而不加雪利酒，汤品依然会鲜美如常。

source: Ingredients
zh_cn: 食材：

source: Serves 4
zh_cn: 四人份

source: 1 large onion, halved
zh_cn: 1颗大洋葱，切半

source: dry (fino) sherry
zh_cn: 4勺干（淡色）雪利酒

source: 1 kg butternut squash peeled, deseeded and chopped
zh_cn: 1千克冬南瓜，削皮、去籽、切块儿

source: 600 ml hot vegetable stock (we like Marigold)
zh_cn: 600毫升热蔬菜高汤（Marigold牌不错）

source: seed bread croutons and flat leaf parsley
zh_cn: 一些油煎瓜仁面包丁和宽叶欧芹

source: olive oil
zh_cn: 2勺橄榄油

source: Method
zh_cn: 制作方法：

source: Fry the onion in the oil for 5 mins until softened.
zh_cn: 1.热油，洋葱入锅翻炒5分钟至软。

source: Add the sherry and squash and sizzle for 1-2 mins.
zh_cn: 倒入雪利酒和冬南瓜烹制1-2分钟。

source: Pour in the stock, then cover and simmer for 20 mins until the squash is tender when pierced with a knife.
zh_cn: 加入高汤，然后盖盖儿炖上20分钟直至南瓜软烂。

source: Whizz in a food processor until smooth. Will keep in the fridge for 2 days, or freeze for 6 weeks.
zh_cn: 2.将菜糊倒入搅拌机里搅拌均匀，之后可入冰箱保鲜2天或冷冻长达6周。

source: When ready to eat, reheat until bubbling and serve in small portions topped with seed-bread croutons (see above right) and a parsley sprig.
zh_cn: 如需食用，只要将汤重新煮开，撒上面包丁和欧芹叶即可。

source: Nutrition per serving
zh_cn: 营养价值：

source: 183 kcalories, protein 4.0g, carbohydrate 26.0g, fat 6.0g, saturated fat 1.0g, fibre 5.0g, salt 0.22g.
zh_cn: 卡路里：183卡蛋白质：4.0克，碳水化合物：26.0克，脂肪：6.0克，饱和脂肪：1.0克，纤维素：5.0克，盐：0.22克
